# Lab-Data-Manipulation - Filtering Data

In [1]:
import pandas as pd

# Context 

For this lab you'll use a dataset for UFO observations. The objective is to exercise the manipulation of a dataframe, so we'll use the tools we've learned about `reading`, `renaming`, `selecting specific columns`, `filtering based on conditions` and `merging` dataframes to try to better understand our dataset and store an enriched version of our dataset at the end.

variable	|class|	description
------------|-----|-------------
date_time	|datetime (mdy h:m)	| Date time sighting occurred
city_area	|character	        | City or area of sighting
state	    |character          |	state/region of sighting
country	    |character          |	Country of sighting
ufo_shape	|character          |	UFO Shape
encounter_length	|double     |	Encounter length in seconds
described_encounter_length	|character |	Encounter length as described (eg 1 hour, etc)
description	|character          |	Description of encounter
date_documented	|character      |	Date documented
latitude	|double             |	Latitude
longitude	|double             |	Longitude

## Read the dataset and store it in a dataframe called `ufo`

Pay attention at the file separator.

In [2]:
ufo = pd.read_csv("./assets/w05_02_ufo.csv", sep = ';')

## Check the first 6 columns of the dataframe

In [3]:
ufo.head(2)

,Unnamed: 0,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,date_documented,latitude,longitude
0,0,1949-10-10,1949,10,10,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,4/27/2004,29.883056,-97.941111
1,1,1949-10-10,1949,10,10,10/10/1949 21:00,lackland afb,tx,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.384210,-98.581082

In [4]:
ufo.iloc[:, :6]

       Unnamed: 0        date  year  month  day         date_time
0               0  1949-10-10  1949     10   10  10/10/1949 20:30
1               1  1949-10-10  1949     10   10  10/10/1949 21:00
2               2  1955-10-10  1955     10   10  10/10/1955 17:00
3               3  1956-10-10  1956     10   10  10/10/1956 21:00
4               4  1960-10-10  1960     10   10  10/10/1960 20:00
...           ...         ...   ...    ...  ...               ...
80327       80327  2013-09-09  2013      9    9    9/9/2013 21:15
80328       80328  2013-09-09  2013      9    9    9/9/2013 22:00
80329       80329  2013-09-09  2013      9    9    9/9/2013 22:00
80330       80330  2013-09-09  2013      9    9    9/9/2013 22:20
80331       80331  2013-09-09  2013      9    9    9/9/2013 23:00

[80332 rows x 6 columns]

## Check the shape of your dataframe to see how many rows and columns it has

In [5]:
ufo.shape

(80332, 16)

## Bring the date information to the beginning of the dataframe

If you check the dataframe columns, there are some information of the date at the end of the dataframe. For this task, you should reorder the columns in a way that the first few columns all show the date information. 

*Hint: Use the ufo.columns to see all the column names you have.*

In [6]:
ufo.columns.tolist()

['Unnamed: 0',
 'date',
 'year',
 'month',
 'day',
 'date_time',
 'city_area',
 'state',
 'country',
 'ufo_shape',
 'encounter_length',
 'described_encounter_length',
 'description',
 'date_documented',
 'latitude',
 'longitude']

In [7]:
new_columns_order = ['date', 'year', 'month', 'day', 'date_time', 'city_area',
                 'state', 'country', 'ufo_shape', 'encounter_length',
                 'described_encounter_length', 'description',
                 'date_documented', 'latitude', 'longitude']

ufo = ufo[new_columns_order]

## Just check if you did it the right way. Take a look at the head of the dataframe again and see if the `ufo` dataframe now is reordered.

In [8]:
ufo.columns

Index(['date', 'year', 'month', 'day', 'date_time', 'city_area', 'state',
       'country', 'ufo_shape', 'encounter_length',
       'described_encounter_length', 'description', 'date_documented',
       'latitude', 'longitude'],
      dtype='object')

In [9]:
ufo.head(2)

,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,date_documented,latitude,longitude
0,1949-10-10,1949,10,10,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,4/27/2004,29.883056,-97.941111
1,1949-10-10,1949,10,10,10/10/1949 21:00,lackland afb,tx,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.384210,-98.581082

## Select a piece of your dataframe. We won't work with the whole dataframe for now, just a few columns. Create a new dataframe called `ufo_vars` and select only the following columns of the `ufo` dataframe. 

`year`, `month`, `state`, `country`, `ufo_shape`, `encounter_length`

In [10]:
# no need for .copy()
# ufo_vars = ufo[['year', 'month', 'state', 'country', 'ufo_shape', 'encounter_length']].copy()


ufo_vars = ufo[['year', 'month', 'state', 'country', 'ufo_shape', 'encounter_length']]

Perform a *.head()* on your result to check if you did it right.

Expected output:


|    |   year |   month | state   | country   | ufo_shape   |   encounter_length |
|---:|-------:|--------:|:--------|:----------|:------------|-------------------:|
|  0 |   1949 |      10 | tx      | us        | cylinder    |               2700 |
|  1 |   1949 |      10 | tx      | nan       | light       |               7200 |
|  2 |   1955 |      10 | nan     | gb        | circle      |                 20 |
|  3 |   1956 |      10 | tx      | us        | circle      |                 20 |
|  4 |   1960 |      10 | hi      | us        | light       |                900 |

In [11]:
ufo_vars.head()

   year  month state country ufo_shape  encounter_length
0  1949     10    tx      us  cylinder            2700.0
1  1949     10    tx     NaN     light            7200.0
2  1955     10   NaN      gb    circle              20.0
3  1956     10    tx      us    circle              20.0
4  1960     10    hi      us     light             900.0

In [12]:
#ufo_vars.info()

In [13]:
# Check df NaN values

# ufo_vars[ufo_vars.isnull().any(axis=1)]

In [14]:
# Check NaN values at column encounter_length

# ufo_vars['encounter_length'].isnull().values.sum()

In [15]:
# Remove NaN values at column encounter_length and convert column from float to int

# ufo_vars = ufo_vars.dropna(subset = ['encounter_length'])

# ufo_vars['encounter_length'].isnull().values.sum()

In [16]:
# Convert encounter_length column from float to int

# ufo_vars.encounter_length.astype(int)

In [17]:
#ufo_vars.info()

In [18]:
#ufo_vars['encounter_length'].isnull().any()

## Rename the variable `encounter_length` to `encounter_seconds`. Keep using the `ufo_vars` dataset for the following tasks, unless specifically specified.

Again, check your results to check if you did it right.

Expected output:


|    |   year |   month | state   | country   | ufo_shape   |   encounter_seconds |
|---:|-------:|--------:|:--------|:----------|:------------|--------------------:|
|  0 |   1949 |      10 | tx      | us        | cylinder    |                2700 |
|  1 |   1949 |      10 | tx      | nan       | light       |                7200 |
|  2 |   1955 |      10 | nan     | gb        | circle      |                  20 |
|  3 |   1956 |      10 | tx      | us        | circle      |                  20 |
|  4 |   1960 |      10 | hi      | us        | light       |                 900 |

In [19]:
ufo_vars.rename(columns={'encounter_length':'encounter_seconds'}).head()

   year  month state country ufo_shape  encounter_seconds
0  1949     10    tx      us  cylinder             2700.0
1  1949     10    tx     NaN     light             7200.0
2  1955     10   NaN      gb    circle               20.0
3  1956     10    tx      us    circle               20.0
4  1960     10    hi      us     light              900.0

## Let's start filtering some records. Create a new dataframe called `ufo_us` and filter the `ufo_vars` dataframe bringing only the results in which the `country` is `"us"`



Expected output:


|    |   year |   month | state   | country   | ufo_shape   |   encounter_seconds |
|---:|-------:|--------:|:--------|:----------|:------------|--------------------:|
|  0 |   1949 |      10 | tx      | us        | cylinder    |                2700 |
|  3 |   1956 |      10 | tx      | us        | circle      |                  20 |
|  4 |   1960 |      10 | hi      | us        | light       |                 900 |
|  5 |   1961 |      10 | tn      | us        | sphere      |                 300 |
|  7 |   1965 |      10 | ct      | us        | disk        |                1200 |

In [20]:
ufo_us = ufo_vars[ufo_vars.country == 'us']

ufo_us.head()

   year  month state country ufo_shape  encounter_length
0  1949     10    tx      us  cylinder            2700.0
3  1956     10    tx      us    circle              20.0
4  1960     10    hi      us     light             900.0
5  1961     10    tn      us    sphere             300.0
7  1965     10    ct      us      disk            1200.0

In [21]:
len(ufo_us)

65114

In [22]:
# Option 2

# condition = (ufo_vars['country'] == 'us')
# ufo_us = ufo_vars[condition]
# ufo_us.head()

### Use the `.query()` method to perform the same task as above

In [23]:
ufo_vars.query('country == "us"').head()

   year  month state country ufo_shape  encounter_length
0  1949     10    tx      us  cylinder            2700.0
3  1956     10    tx      us    circle              20.0
4  1960     10    hi      us     light             900.0
5  1961     10    tn      us    sphere             300.0
7  1965     10    ct      us      disk            1200.0

In [24]:
len(ufo_vars.query('country == "us"'))

65114

See which one do you prefer the most and keep using it for the exercises that follow

## For the `ufo_us` dataframe, select only the cases in which the year is in the first decade (2001-2010). Put that in a variable called `ufo_us_2000`.

Check your results.

In [25]:
ufo_us.query('2001 <= year <= 2010')

       year  month state country  ufo_shape  encounter_length
102    2001     10    ia      us   triangle             240.0
105    2001     10    ca      us     circle             120.0
106    2001     10    ia      us  rectangle             300.0
107    2001     10    ca      us   changing             900.0
108    2001     10    az      us   triangle              60.0
...     ...    ...   ...     ...        ...               ...
80269  2010      9    mi      us   changing             300.0
80270  2010      9    fl      us       oval            2700.0
80271  2010      9    fl      us       oval            7200.0
80272  2010      9    nm      us   fireball             300.0
80273  2010      9    ca      us     circle             300.0

[31910 rows x 6 columns]

In [26]:
# Option 2

# ufo_us_2000 = ufo_us.query('year > 2000 and year <= 2010')
# ufo_us_2000.head()

## Try to do the same without the intermediate step of creating the `ufo_us` dataframe. That is, try to filter the dataset for the cases in which the country is "us" and the year is (2001-2010) from the original dataframe.



*Hint:* You have to make sure all of these conditions are applied simultaneously - using the `and` (or `&`) operator. Try to understand when to use the `and` and the `&` operator.

In [27]:
ufo_vars[(ufo_vars['country'] == 'us') &
         (ufo_vars['year'] >= 2001) &
         (ufo_vars['year'] <= 2010)]

       year  month state country  ufo_shape  encounter_length
102    2001     10    ia      us   triangle             240.0
105    2001     10    ca      us     circle             120.0
106    2001     10    ia      us  rectangle             300.0
107    2001     10    ca      us   changing             900.0
108    2001     10    az      us   triangle              60.0
...     ...    ...   ...     ...        ...               ...
80269  2010      9    mi      us   changing             300.0
80270  2010      9    fl      us       oval            2700.0
80271  2010      9    fl      us       oval            7200.0
80272  2010      9    nm      us   fireball             300.0
80273  2010      9    ca      us     circle             300.0

[31910 rows x 6 columns]

In [28]:
# Option 2

# ufo.query('country == "us" and year > 2000 and year <= 2010')

## BONUS 1:  Take a look at the column named `ufo_shape`. Compare the number of triangular UFO occurrances in the US from the year 2001 up to 2010 as compared to the years of 1991 up to 2000.

*Hint: you should expect roughly ~3 times more cases for 2001-2010 than 1991-2000.*

In [29]:
# calculate the dataframe from 2001-2010 here

triangle_ufo_2000 = ufo_vars[(ufo['country'] == 'us') &
                             (ufo_vars['ufo_shape'] == 'triangle') &
                             (ufo_vars['year'] >= 2001) &
                             (ufo_vars['year'] <= 2010)]

triangle_ufo_2000

       year  month state country ufo_shape  encounter_length
102    2001     10    ia      us  triangle             240.0
108    2001     10    az      us  triangle              60.0
109    2001     10    va      us  triangle              30.0
127    2004     10    nj      us  triangle             180.0
147    2005     10    pa      us  triangle             300.0
...     ...    ...   ...     ...       ...               ...
80195  2004      9    mi      us  triangle             240.0
80231  2008      9    il      us  triangle               7.0
80235  2009      9    co      us  triangle             900.0
80248  2009      9    or      us  triangle             300.0
80256  2009      9    mi      us  triangle             360.0

[3353 rows x 6 columns]

In [30]:
# calculate the dataframe from 1991-2000 here

triangle_ufo_1990 = ufo_vars[(ufo['country'] == 'us') &
                             (ufo_vars['ufo_shape'] == 'triangle') &
                             (ufo_vars['year'] >= 1991) &
                             (ufo_vars['year'] <= 2000)]

triangle_ufo_1990

       year  month state country ufo_shape  encounter_length
50     1991     10    pa      us  triangle             600.0
64     1996     10    mo      us  triangle               3.0
70     1997     10    ga      us  triangle             300.0
78     1998     10    wa      us  triangle             600.0
291    1994     10    nj      us  triangle             300.0
...     ...    ...   ...     ...       ...               ...
79711  2000      9    az      us  triangle             120.0
79712  2000      9    ny      us  triangle             300.0
79897  1999      9    wa      us  triangle              10.0
79898  1999      9    or      us  triangle              15.0
80139  2000      9    pa      us  triangle              15.0

[1116 rows x 6 columns]

In [31]:
print('')
print(f"\033[1;43m Number of triangular UFO occurrances in the US: ")
print('')
print(f"\033[0;46m Year 1991 to 2000: {len(triangle_ufo_1990)} ")
print('')
print(f"\033[0;46m Year 2001 to 2010: {len(triangle_ufo_2000)} ")
print('')
print(f"\033[1;41m Growth: {round((len(triangle_ufo_1990)/len(triangle_ufo_2000) * 100), 2)}% ")
print('')

 Number of triangular UFO occurrances in the US:

 Year 1991 to 2000: 1116

 Year 2001 to 2010: 3353

 Growth: 33.28%

## BONUS 1.1: Count how many values does each category of `ufo_shape` has. 

Expected output:

````
        light        16565
        triangle      7865
        circle        7608
        fireball      6208
        other         5649
        unknown       5584
        sphere        5387
        disk          5213
        oval          3733
        formation     2457
        cigar         2057
        changing      1962
        flash         1328
        rectangle     1297
        cylinder      1283
        diamond       1178
        chevron        952
        egg            759
        teardrop       750
        cone           316
        cross          233
        delta            7
        round            2
        crescent         2
        dome             1
        pyramid          1
        changed          1
        hexagon          1
        flare            1
        Name: ufo_shape, dtype: int64

````

In [32]:
ufo_vars.ufo_shape.value_counts()

light        16565
triangle      7865
circle        7608
fireball      6208
other         5649
unknown       5584
sphere        5387
disk          5213
oval          3733
formation     2457
cigar         2057
changing      1962
flash         1328
rectangle     1297
cylinder      1283
diamond       1178
chevron        952
egg            759
teardrop       750
cone           316
cross          233
delta            7
crescent         2
round            2
dome             1
pyramid          1
changed          1
flare            1
hexagon          1
Name: ufo_shape, dtype: int64

### Mask hints 

A `mask` is nothing more than a condition. This condition is applied to your whole dataframe (or pandas Series).
So for example, if you had a pandas Series with a variable called `Age`, you could create a mask for all people whose `Age` is less than 18 years old using the syntax:

`df['Age'] <= 18`

This would return a pandas series containing `True` and `False` values. For each index, you'd get a value of `True` or `False`.

You could save this mask in a variable, for example:

`condition = (df['Age'] <= 18)`

And then you could use that variable `condition` to select only the cases of the dataframe in which the index returned `True` using:
`df.loc[condition, :]`.


### `.query()` hints

Remember that the .query() method expects a string. That string should contain the variable of your dataframe without quotation marks and the comparison. For example, if you had a variable called `name`, you'd use a syntax like:
 `df.query('name == "Jack"')`
 
to bring all observations whose column `name` is exactly equal to `"Jack"` (note that Jack should be within quotation marks because a name is a string in this example).